[
{"TITLE":"Agile Methods","DESCRIPTION":"Agile Methods focus on processes and techniques for managing software projects under challenging conditions. Agile Methods are important because computer systems often have to be developed and deployed under pressures of time and in uncertain settings, where more traditional software development techniques have proved to be too cumbersome. The Agile Methods theme addresses iterative software development, the construction of software from components, and evolution of existing software systems. The Agile Systems theme builds on Object-Oriented Programming in Java in the first year","COURSE1":"COMP20341","COURSE2":"MSEC31131","COURSE3":"COMP30332","COURSE4":""},
{"TITLE":"Computer Architecture","DESCRIPTION":"Computer Architecture involves the selection and interconnection of hardware components to create computers that meet functional, performance and cost goals. As a result, the development of effective computer architectures is a central part of technology development, and an understanding of the capabilities of architectures is important for developers of higher-level systems. The Computer Architecture theme includes fundamental material on the components of architectures, before progressing to specific advanced architectures. The Computer Architecture theme builds on Fundamentals of Computer Architecture in the first year","COURSE1":"Dont know","COURSE2":"COMP30002","COURSE3":"COMP30002","COURSE4":""},
{"TITLE":"Computer Languages","DESCRIPTION":"Computer Languages are central to the development of software systems; a good understanding of programming languages is important for software developers, and many sub-disciplines of computer science use specialised languages that suit their specific requirements. The Computer Languages theme addresses the design and specification of programming languages, and the techniques that have been developed for implementing languages in different settings. The Computer Languages theme builds on Object-Oriented Programming in Java in the first year","COURSE1":"Dont Know","COURSE2":"","COURSE3":"COMP30172","COURSE4":"COMP30151"},
{"TITLE":"Enterprise Information systems","DESCRIPTION":"Enterprise Information Systems are central to the management of data and provision of services in government and commerce; such systems typically manage, and support the use of, the data resources that are central to the operation and management of any large organisation. The Enterprise Information Systems theme covers the data management technologies that underpin enterprise systems, and related techniques for database design, data integration and data analysis. The Enterprise Information Systems theme builds on the Group Project in the first year","COURSE1":"COMP20312","COURSE2":"COMP30311","COURSE3":"COMP37332","COURSE4":""},
{"TITLE":"Information Systems in Business","DESCRIPTION":"Information Systems in Business addresses the role and impact of software systems within organisations. Many large scale software development projects fail either because business requirements, organisational structures or inter-organisational relationships are less than fully reflected in the design or deployment of the new software. The Information Systems in Business theme covers both the modelling and design of business information systems, and the context within which they must work. The Information Systems in Business theme builds on the Fundamentals of Information Systems course unit in the first year","COURSE1":"Dont know","COURSE2":"Dont know","COURSE3":"Dont know","COURSE4":""},
{"TITLE":"Learning and Search in Artificial Intelligence","DESCRIPTION":"Learning and Search in Artificial Intelligence is concerned with constructing intelligent systems that can adapt to a changing and uncertain environment. Machine learning combines real-world data with flexible models to address a broad range of applications, including pattern recognition, robot navigation, game playing and financial prediction. Search methods are required to parameterize models, make optimal decisions and carry out intelligent actions. The Learning and Search in Artificial Intelligence theme builds on the Fundamentals of Artificial Intelligence course unit in the first year","COURSE1":"Dont know","COURSE2":"Dont know","COURSE3":"Dont know","COURSE4":""},
{"TITLE":"Mobile Computing and Networks","DESCRIPTION":"Mobile Computing and Networks is concerned with the provision of an infrastructure whereby distributed computational devices can co-operate efficiently and securely. Both wired and wireless networks are increasingly ubiquitous, and the importance of networked computing increases with the number and diversity of networked devices and mobile applications. The Mobile Computing and Networks theme builds on Fundamentals of Distributed Systems in the first year","COURSE1":"COMP20252","COURSE2":"COMP30082","COURSE3":"","COURSE4":""},
{"TITLE":"Natural Language, Representation and Reasoning","DESCRIPTION":"Natural Language, Representation and Reasoning is concerned with techniques and tools for capturing and making use of knowledge in computer systems. Knowledge representation is important in many applications, from the description of web pages in the semantic web, to the interpretation of natural language statements in grammar checkers and machine translators. The Natural Language, Representation and Reasoning theme builds on Fundamentals of Artificial Intelligence in the first year","COURSE1":"COMP20442","COURSE2":"COMP30411","COURSE3":"Dont know","COURSE4":""},
{"TITLE":"Rigorous Development","DESCRIPTION":"Rigorous Development is concerned with techniques for specifying and analysing algorithms and systems, with a view to reaching a level of understanding that enables guarantees to be made about their behaviour. Rigorous Development is important as many applications of computer systems are both complex and safety critical, and thus stand to benefit from a systematic investigation of their properties. The Rigorous Development theme builds on Fundamentals of Logic and Reasoning in the first year","COURSE1":"Dont know","COURSE2":"COMP30172","COURSE3":"COMP30112","COURSE4":""},
{"TITLE":"Software Engineering","DESCRIPTION":"Software Engineering is concerned with all aspects of software production, from the early stages of requirements gathering, through system design and implementation, to maintenance and evolution. Software Engineering is important because software projects many involve large teams of people, diverse or conflicting requirements, tight timescales and limited budgets. The Software Engineering theme provides practical experience in group development projects of a wide range of tools and techniques that have been developed with a view to supporting systematic software development. The Software Engineering theme builds on the Group Project in the first year","COURSE1":"COMP20341","COURSE2":"COMP30061","COURSE3":"COMP30332","COURSE4":""},
{"TITLE":"System-on-Chip","DESCRIPTION":"System-on-Chip involves the integration of the components in a computer or other electronic system into a single integrated circuit. System-on-Chip techniques are of increasing importance because they support the development of specialised embedded systems, such as MP3 players. The System-on-Chip theme explores the techniques used in digital system design and implementation, the languages used to express such designs, and design to support specific requirements such as low power. The System-on-Chip theme builds on Fundamentals of Computer Engineering in the first year","COURSE1":"Dont know","COURSE2":"Dont know","COURSE3":"Dont know","COURSE4":""},
{"TITLE":"Visual Computing","DESCRIPTION":"Visual Computing is concerned with all aspects of the acquisition, analysis and production of visual data. Visual Computing is important because numerous applications capture or present visual data. For example, visual data presentation is central in applications from scientific visualisation to games, and image capture and analysis is important in applications from face recognition to medical imaging. The Visual Computing theme introduces the theory and practice of 2 and 3 dimensional computer graphics, and explores the tools and algorithms of computer vision for recognising and interpreting features in images or sequences of images. The Visual Computing theme builds on Object-Oriented Programming in Java in the first year","COURSE1":"COMP20072","COURSE2":"COMP30071","COURSE3":"COMP30432","COURSE4":""},
{"TITLE":"Web and Distributed Systems","DESCRIPTION":"Web and Distributed Systems are among the most widely used computing systems, and are increasingly central to commercial, educational and leisure activities. However, the design and development of efficient, robust and scaleable distributed systems presents many challenges. The Web and Distributed Systems theme provides experience on the principles, techniques and methods of distributed computing, and explores the concepts and technologies that support web applications. The Web and Distributed Systems theme builds on Fundamentals of Distributed Systems in the first year.","COURSE1":"Dont know","COURSE2":"Dont know","COURSE3":"Dont know","COURSE4":""},
{"TITLE":"Programming and Algorithms","DESCRIPTION":"Algorithms capture the way in which a problem is to be solved. As a result, algorithms are central to software development, and a wide range of techniques have been developed that underpin the design and analysis of algorithms. This theme explores a wide range of algorithms and data structures, investigates how their properties can be analysed systematically, and explores how they can be implemented efficiently. The Programming and Algorithms theme builds on Object-Oriented Programming in Java in the first year.","COURSE1":"COMP20012","COURSE2":"COMP30172","COURSE3":"","COURSE4":""},
]